# HeatCapacityPerArea Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..HeatCapacityPerArea Property
SpecTypeId Class See Also
---
Heat Capacity per Area, in discipline Energy.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId HeatCapacityPerArea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HeatCapacityPerArea As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ HeatCapacityPerArea {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace